[
    {
        "id": 1,
        "book": 1,
        "number": 1,
        "arabic": "عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه\"",
        "english": "On the authority of the Commander of the Faithful, Abu Hafs 'Umar bin al-Khattab, radiyallahu 'anhu, who said: I heard the Messenger of Allah, sallallahu 'alayhi wasallam, say: \"Actions are but by intention and every man shall have but that which he intended. Thus he whose migration was for Allah and His messenger, his migration was for Allah and His messenger, and he whose migration was to achieve some worldly benefit or to take some woman in marriage, his migration was for that for which he migrated.\"",
        "url": "https://sunnah.com/riyadussalihin:1"
    },
    {
        "id": 2,
        "book": 1,
        "number": 2,
        "arabic": "وعن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: \"من أحدث في أمرنا هذا ما ليس منه فهو رد\"",
        "english": "On the authority of 'A'ishah, radiyallahu 'anha, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"He who innovates something in this matter of ours [i.e. Islam] that is not of it will have it rejected [by Allah].\"",
        "url": "https://sunnah.com/riyadussalihin:2"
    },
    {
        "id": 3,
        "book": 1,
        "number": 3,
        "arabic": "وعن أبي عبد الله النعمان بن بشير رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"إن الحلال بين، وإن الحرام بين، وبينهما أمور مشتبهات لا يعلمهن كثير من الناس، فمن اتقى الشبهات فقد استبرأ لدينه وعرضه، ومن وقع في الشبهات وقع في الحرام\"",
        "english": "On the authority of Abu 'Abdullah an-Nu'man ibn Bashir, radiyallahu 'anhumaa, who said: I heard the Messenger of Allah, sallallahu 'alayhi wasallam, say: \"That which is lawful is clear and that which is unlawful is clear, and between the two of them are doubtful matters about which not many people know. Thus he who avoids doubtful matters clears himself in regard to his religion and his honor, but he who falls into doubtful matters falls into that which is unlawful.\"",
        "url": "https://sunnah.com/riyadussalihin:3"
    },
    {
        "id": 4,
        "book": 1,
        "number": 4,
        "arabic": "وعن أبي هريرة عبد الرحمن بن صخر رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"ما نهيتكم عنه فاجتنبوه، وما أمرتكم به فأتوا منه ما استطعتم، فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم\"",
        "english": "On the authority of Abu Hurayrah, 'Abd ar-Rahman ibn Sakhr, radiyallahu 'anhu, who said: I heard the Messenger of Allah, sallallahu 'alayhi wasallam, say: \"What I have forbidden for you, avoid. What I have commanded you [to do], do as much of it as you can. For verily, it was only their excessive questioning and their disagreeing with their Prophets that destroyed [the nations] who were before you.\"",
        "url": "https://sunnah.com/riyadussalihin:4"
    },
    {
        "id": 5,
        "book": 1,
        "number": 5,
        "arabic": "وعن أم المؤمنين أم عبد الله عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: \"من عمل عملاً ليس عليه أمرنا فهو رد\"",
        "english": "On the authority of the Mother of the Faithful, Umm 'Abdullah 'A'ishah, radiyallahu 'anha, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"He who does an act which we have not commanded, will have it rejected [by Allah].\"",
        "url": "https://sunnah.com/riyadussalihin:5"
    },
    {
        "id": 6,
        "book": 1,
        "number": 6,
        "arabic": "وعن أبي عبد الله جابر بن عبد الله الأنصاري رضي الله عنهما أن رجلاً سأل رسول الله صلى الله عليه وسلم فقال: أرأيت إذا صليت المكتوبات، وصمت رمضان، وأحللت الحلال، وحرمت الحرام، ولم أزد على ذلك شيئاً، أأدخل الجنة؟ قال: \"نعم\"",
        "english": "On the authority of Abu 'Abdullah Jabir ibn 'Abdullah al-Ansari, radiyallahu 'anhumaa, that a man asked the Messenger of Allah, sallallahu 'alayhi wasallam: \"Do you think that if I perform the obligatory prayers, fast in Ramadan, treat as lawful that which is lawful, and treat as forbidden that which is forbidden, and do not add anything more to that, I will enter Paradise?\" He said: \"Yes.\"",
        "url": "https://sunnah.com/riyadussalihin:6"
    },
    {
        "id": 7,
        "book": 1,
        "number": 7,
        "arabic": "وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"الدين النصيحة\" قلنا: لمن؟ قال: \"لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم\"",
        "english": "On the authority of Abu Hurayrah, radiyallahu 'anhu, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"Religion is sincerity.\" We said: \"To whom?\" He said: \"To Allah, to His Book, to His Messenger, and to the leaders of the Muslims and their common folk.\"",
        "url": "https://sunnah.com/riyadussalihin:7"
    },
    {
        "id": 8,
        "book": 1,
        "number": 8,
        "arabic": "وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: \"أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمداً رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله\"",
        "english": "On the authority of Ibn 'Umar, radiyallahu 'anhumaa, that the Messenger of Allah, sallallahu 'alayhi wasallam, said: \"I have been ordered to fight against people until they testify that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, and until they establish the prayer and pay the zakat. And if they do so then they will have gained protection from me for their lives and property, unless [they commit acts that are punishable] in accordance with Islam, and their reckoning will be with Allah.\"",
        "url": "https://sunnah.com/riyadussalihin:8"
    },
    {
        "id": 9,
        "book": 1,
        "number": 9,
        "arabic": "وعن أبي هريرة عبد الرحمن بن صخر رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"كل أمتي يدخلون الجنة إلا من أبى\" قيل: ومن يأبى يا رسول الله؟ قال: \"من أطاعني دخل الجنة، ومن عصاني فقد أبى\"",
        "english": "On the authority of Abu Hurayrah, 'Abd ar-Rahman ibn Sakhr, radiyallahu 'anhu, who said: I heard the Messenger of Allah, sallallahu 'alayhi wasallam, say: \"All of my ummah will enter Paradise except those who refuse.\" It was said: \"O Messenger of Allah, who will refuse?\" He said: \"Whoever obeys me enters Paradise, and whoever disobeys me has refused.\"",
        "url": "https://sunnah.com/riyadussalihin:9"
    },
    {
        "id": 10,
        "book": 1,
        "number": 10,
        "arabic": "عن أبي موسى عبد الله بن قيس الأشعري رضي الله عنه قال: سئل رسول الله صلى الله عليه وسلم عن الرجل يقاتل شجاعة، ويقاتل حمية، ويقاتل رياءً، أي ذلك في سبيل الله؟ فقال رسول الله صلى الله عليه وسلم: \"من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله\"",
        "english": "On the authority of Abu Musa 'Abdullah ibn Qays al-Ash'ari, radiyallahu 'anhu, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, was asked about a man who fights courageously, and a man who fights out of zeal, and a man who fights to show off - which of these is in the way of Allah? The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"He who fights so that the word of Allah is supreme, he is in the way of Allah.\"",
        "url": "https://sunnah.com/riyadussalihin:10"
    },
    {
        "id": 11,
        "book": 1,
        "number": 11,
        "arabic": "وعن سعد بن أبي وقاص رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إنك لن تنفق نفقة تبتغي بها وجه الله إلا أجرت عليها، حتى ما تجعل في في امرأتك\"",
        "english": "On the authority of Sa'd ibn Abi Waqqas, radiyallahu 'anhu, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"Verily, you will never spend anything seeking Allah's countenance except that you will be rewarded for it, even that which you place in your wife's mouth.\"",
        "url": "https://sunnah.com/riyadussalihin:11"
    },
    {
        "id": 12,
        "book": 1,
        "number": 12,
        "arabic": "وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن الله لا ينظر إلى أجسامكم ولا إلى صوركم، ولكن ينظر إلى قلوبكم وأعمالكم\"",
        "english": "On the authority of Abu Hurayrah, radiyallahu 'anhu, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"Verily Allah does not look at your bodies nor at your faces but He looks at your hearts and your actions.\"",
        "url": "https://sunnah.com/riyadussalihin:12"
    },
    {
        "id": 13,
        "book": 2,
        "number": 13,
        "arabic": "وعن أبي محمد عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"لا يؤمن أحدكم حتى يكون هواه تبعاً لما جئت به\"",
        "english": "On the authority of Abu Muhammad 'Abdullah ibn 'Amr ibn al-'As, radiyallahu 'anhumaa, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"None of you [truly] believes until his inclination is in accordance with what I have brought.\"",
        "url": "https://sunnah.com/riyadussalihin:13"
    },
    {
        "id": 14,
        "book": 2,
        "number": 14,
        "arabic": "وعن أنس رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"قال الله تعالى: يا ابن آدم، إنك ما دعوتني ورجوتني غفرت لك على ما كان منك ولا أبالي\"",
        "english": "On the authority of Anas, radiyallahu 'anhu, who said: I heard the Messenger of Allah, sallallahu 'alayhi wasallam, say: \"Allah the Almighty has said: 'O son of Adam, as long as you call upon Me and ask of Me, I shall forgive you for what you have done, and I shall not mind.'\"",
        "url": "https://sunnah.com/riyadussalihin:14"
    },
    {
        "id": 15,
        "book": 2,
        "number": 15,
        "arabic": "وعن معاذ رضي الله عنه قال: كنت رديف النبي صلى الله عليه وسلم على حمار، فقال لي: \"يا معاذ، أتدري ما حق الله على العباد؟ وما حق العباد على الله؟\" قلت: الله ورسوله أعلم. قال: \"حق الله على العباد أن يعبدوه ولا يشركوا به شيئاً، وحق العباد على الله أن لا يعذب من لا يشرك به شيئاً\"",
        "english": "On the authority of Mu'adh, radiyallahu 'anhu, who said: I was riding behind the Prophet, sallallahu 'alayhi wasallam, on a donkey, and he said to me: \"O Mu'adh, do you know what is Allah's right upon His servants and what is the servants' right upon Allah?\" I said: \"Allah and His Messenger know best.\" He said: \"Allah's right upon His servants is that they should worship Him and not associate anything with Him. And the servants' right upon Allah is that He should not punish anyone who does not associate anything with Him.\"",
        "url": "https://sunnah.com/riyadussalihin:15"
    },
    {
        "id": 16,
        "book": 2,
        "number": 16,
        "arabic": "وعن ابن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا حسد إلا في اثنتين: رجل آتاه الله مالاً فسلطه على هلكته في الحق، ورجل آتاه الله حكمة فهو يقضي بها ويعلمها\"",
        "english": "On the authority of Ibn Mas'ud, radiyallahu 'anhu, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"There is no [acceptable] envy except in two cases: a person whom Allah has given wealth and he spends it in the right way, and a person whom Allah has given wisdom and he acts according to it and teaches it to others.\"",
        "url": "https://sunnah.com/riyadussalihin:16"
    },
    {
        "id": 17,
        "book": 2,
        "number": 17,
        "arabic": "وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من تعلم علماً مما يبتغى به وجه الله لا يتعلمه إلا ليصيب به عرضاً من الدنيا لم يجد عرف الجنة يوم القيامة\"",
        "english": "On the authority of Abu Hurayrah, radiyallahu 'anhu, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"Whoever learns knowledge by which the face of Allah is sought, but learns it only to gain some worldly benefit, will not smell the fragrance of Paradise on the Day of Resurrection.\"",
        "url": "https://sunnah.com/riyadussalihin:17"
    },
    {
        "id": 18,
        "book": 2,
        "number": 18,
        "arabic": "وعن أبي سعيد الخدري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"من رأى منكم منكراً فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه، وذلك أضعف الإيمان\"",
        "english": "On the authority of Abu Sa'id al-Khudri, radiyallahu 'anhu, who said: I heard the Messenger of Allah, sallallahu 'alayhi wasallam, say: \"Whoever among you sees a wrong action, then let him change it with his hand; if he cannot, then with his tongue; if he cannot, then with his heart - and that is the weakest of faith.\"",
        "url": "https://sunnah.com/riyadussalihin:18"
    },
    {
        "id": 19,
        "book": 2,
        "number": 19,
        "arabic": "وعن ابن عباس رضي الله عنهما قال: كنت خلف النبي صلى الله عليه وسلم يوماً، فقال: \"يا غلام، إني أعلمك كلمات: احفظ الله يحفظك، احفظ الله تجده تجاهك، إذا سألت فاسأل الله، وإذا استعنت فاستعن بالله\"",
        "english": "On the authority of Ibn 'Abbas, radiyallahu 'anhumaa, who said: One day I was behind the Prophet, sallallahu 'alayhi wasallam, and he said to me: \"Young man, I shall teach you some words [of advice]: Be mindful of Allah and Allah will protect you. Be mindful of Allah and you will find Him in front of you. If you ask, then ask Allah [alone]; and if you seek help, then seek help from Allah [alone].\"",
        "url": "https://sunnah.com/riyadussalihin:19"
    },
    {
        "id": 20,
        "book": 2,
        "number": 20,
        "arabic": "وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدر الله وما شاء فعل، فإن لو تفتح عمل الشيطان\"",
        "english": "On the authority of Abu Hurayrah, radiyallahu 'anhu, who said: The Messenger of Allah, sallallahu 'alayhi wasallam, said: \"Be eager for that which benefits you, seek help from Allah, and do not feel helpless. If anything befalls you, do not say: 'If only I had done such-and-such, then such-and-such would have happened,' but rather say: 'Allah has decreed, and what He wills He does,' for verily 'if only' opens the door to Satan's work.\"",
        "url": "https://sunnah.com/riyadussalihin:20"
    }
]
